{"data":{"projects":{"edges":[{"node":{"frontmatter":{"title":"Portfolio","short":"A simple personal portfolio realized as a responsive SPA (single page app)."},"html":"<h3>PROBLEM</h3>\n<p>It's been a while since I wanted to create a brief website to introduce myself and to show few of my projects I worked on. I didn't want something too verbose, instead I did want a site explorative, responsive, super-fast and pretty.</p>\n<h3>SOLUTION</h3>\n<p>There were hundreds of way to realize this site and I explored many, but at the end I've chosen the hardest and the longest. Why? Honestly, just because <strong>it was fun</strong> and I wanted to play with some new technology I recently learned. I'm talking about the big combo: <strong>Gatsby + React.js</strong>.</p>\n<p>Since the very beginning, I decided to use a CMS, just to leverage some basic functionality and to have a scalable platform that gave me the ability to grow in the future. At the same time, I dropped out Wordpress and other \"DB based\" solutions, because in my opinion a database is unnecessary and a waste of resources for a project so small.<br>\nSo, I thought to some flat CMS like GravCMS or Jekyll that I've already used, until I found out Gatsby and I suddenly felt in love with it. It is:</p>\n<ul>\n<li>open source</li>\n<li>based on React.js</li>\n<li>fully compatible with GitHub Pages</li>\n<li>super scalable</li>\n<li>super fast</li>\n<li>based on Javascript for page development and then transpiles everything in HTML</li>\n<li>based on GraphQL for the queries</li>\n<li>pluggable to any data source (from markdown files to APIs)</li>\n<li>actually, it's not even a CMS, but kinda front-end data framework</li>\n<li>much much more than this</li>\n</ul>\n<p>In one word: it's perfect!</p>\n<p>This choice slowed me a bit (actually, quite a lot 😬), but it was an amazing experience, where I learned so many things (especially <a href=\"https://bulma.io\">Bulma CSS</a> and <a href=\"https://graphql.org\">GraphQL</a>) that I definitely fancy to use in the future.</p>\n<p>If you never tried Gatsby yet, check it out:<br>\n<a href=\"https://www.gatsbyjs.org\">https://www.gatsbyjs.org</a></p>\n<h3>TECHNOLOGY USED</h3>\n<ul>\n<li><a href=\"https://www.gatsbyjs.org\">Gatsby</a> – Main platform, CMS and transpiler</li>\n<li><a href=\"https://reactjs.org\">React.js</a> – Page components and interactions</li>\n<li><a href=\"https://graphql.org\">GraphQL</a> – Query language for fetching data from Markdown and YAML files</li>\n<li><a href=\"https://www.nodejs.org\">Node.js</a> – Modules manager and interpreter</li>\n<li><a href=\"https://bulma.io\">Bulma CSS</a> – CSS responsive framework</li>\n<li><a href=\"https://fontawesome.com\">Font Awesome</a> – Icons and graphic elements</li>\n<li><a href=\"https://pages.github.com\">GitHub Pages</a> – Hosting service</li>\n</ul>"}},{"node":{"frontmatter":{"title":"AWS SES Email Redirect","short":"A Lambda function to redirect SES inbound emails to an external address as an attachment. Relatively easy to configure, with no data lost in the message's header and fully standard compliant."},"html":"<h3>PROBLEM</h3>\n<p>Many privates or small businesses decide to buy a domain and to configure one or more custom email addresses, but because each one of them already have a personal email account somewhere else (Google, Yahoo, Hotmail, etc…) they don't really want a full email box, but just <strong>a service that redirects the emails</strong>.</p>\n<h3>SOLUTION</h3>\n<p>Thanks to AWS SES + S3 + Lambda and a relative small effort to orchestrate these three services, this is doable in a professional/production way and barely for free!</p>\n<p>I know that around the web there are already a lot of solutions to accomplish this. The problem is that, most of them, are just a <em>\"it works\"</em> solution. They don't really satisfy some requirements, like:</p>\n<ul>\n<li>being able to map more than one custom address to one or more external email</li>\n<li>respect the IETF and W3C email standard specifics</li>\n<li>define an administrator email address to handle any potential error</li>\n</ul>\n<p>If you're interest and want more informations about how to use it, this project is available as <strong>open source</strong> at this link:<br>\n<a href=\"https://github.com/lcrea/aws-ses-email-redirect\">https://github.com/lcrea/aws-ses-email-redirect</a></p>\n<p>You can give it try, propose improvements or share it.</p>\n<h3>TECHNOLOGY USED</h3>\n<ul>\n<li><a href=\"https://nodejs.org\">Node.js</a> – Main interpreter</li>\n<li><a href=\"https://nodemailer.com\">Nodemailer</a> – Module to structure the new emails</li>\n<li><a href=\"https://jestjs.io\">Jest</a> – Test framework for internal code</li>\n<li><a href=\"https://github.com/awslabs/aws-sam-cli\">Amazon SAM CLI</a> – Local Lambda test environment</li>\n<li>\n<p>AWS Services:</p>\n<ul>\n<li><a href=\"https://aws.amazon.com/ses\">SES</a> – Inbound/Outbound email service</li>\n<li><a href=\"https://aws.amazon.com/s3\">S3</a> – Temporary storage service</li>\n<li><a href=\"https://aws.amazon.com/lambda\">Lambda</a> – Computational service on demand</li>\n</ul>\n</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Le Rune di Giorgio Ferraris","short":"A professional responsive website built with a flat file CMS, Amazon AWS and Docker."},"html":"<h3>PROBLEM</h3>\n<p>An insurance consultant – as well as a dear friend of mine – asked me to develop a website as a \"digital presentation\" of his business and himself.</p>\n<h3>SOLUTION</h3>\n<p>This project literally started from scratch: no pre-existent website, no logo, no domain, no infrastructure… nothing! Pretty challenging.</p>\n<p>Each time I have to start from zero, I try to apply a “startup mindset”: that is, starting as soon as possible (fast <abbr title=\"Return Of Investment\">R.O.I.</abbr>), as small as possible (low budget) and then growing proportionally.<br>\nTo do this is essential to have a flexible environment. So, having barely carte blanche on the stack, I proposed him the best compromise between a stack modern/scalable/maintainable and affordable. That is:</p>\n<ul>\n<li><strong>Grav CMS</strong>: one of the best open source flat file CMS around. It's based on PHP, Twig templates, Markdown and YAML contents, no DBs. It is modular, has an admin interface (optional), SEO capabilities, minimal hardware requirements and is manageable via a powerful <abbr title=\"Command Line Interface\">C.L.I.</abbr></li>\n<li><strong>Bootstrap + Font Awesome</strong>: a well known combo for any modern, responsive and mobile first layout.</li>\n<li><strong>Iubenda</strong>: the \"de facto\" solution for easily generate and keep updated a legally correct privacy and cookie policy.</li>\n<li><strong>Amazon AWS</strong>: there's no need for words. It is cheap, powerful and scalable, all together. It has any kind of service for whatsoever project. All the power I needed to easily maintain and to rapidly adapt the whole infrastructure.</li>\n<li><strong>Docker</strong>: this, actually, was more a <em>fun part</em> for me. I know it wasn't really necessary, but I decided to bundle everything inside multiple containers, in order to create an environment easy to test, to duplicate, to move and fully compatible with the <abbr title=\"Continuous Integration\">C.I.</abbr> paradigm. Later, this strategy really paid off.</li>\n</ul>\n<p>You can find the live website at this link:<br>\n<a href=\"https://www.giorgioferraris.me\">https://www.giorgioferraris.me</a></p>\n<h3>TECHNOLOGY USED</h3>\n<ul>\n<li><a href=\"https://getgrav.org\">Grav CMS</a> – No database, file flat content management system</li>\n<li><a href=\"https://getbootstrap.com\">Bootstrap</a> – CSS responsive framework</li>\n<li><a href=\"https://fontawesome.com\">Font Awesome</a> – Icons and graphic elements</li>\n<li><a href=\"https://www.docker.com\">Docker</a> – Software packager and orchestrator</li>\n<li>\n<p>Amazon AWS</p>\n<ul>\n<li><a href=\"https://aws.amazon.com/route53\">Route53</a> – Authoritative DNS service</li>\n<li><a href=\"https://aws.amazon.com/ec2\">EC2</a> – Linux virtual machine</li>\n<li><a href=\"https://aws.amazon.com/ecs\">ECS</a> – Docker images repository</li>\n</ul>\n</li>\n<li><a href=\"https://www.iubenda.com\">Iubenda</a> – Privacy and cookie policies</li>\n<li><a href=\"https://letsencrypt.org\">Let's Encrypt</a> – Certificate authority</li>\n</ul>"}}]},"tabProject":{"html":"<p>Here's a list of few recent projects I worked on and I'm proud of.</p>"}}}